/*******************************************************************************
*                                 头文件包含
*******************************************************************************/

#include <ucos_ii.h>
#include "GUI_Private.h"
#include "lcd_9341.h"

/*******************************************************************************
*                                内部全局变量
*******************************************************************************/

static OS_EVENT *s_pOSSem_GUI;
static OS_EVENT *s_pOSMbox_Event;

/*******************************************************************************
* 函数名称 : GUI_X_Init
* 功能描述 : 硬件初始化
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : GUI_Init() -> GUI_X_Init()
*******************************************************************************/
void GUI_X_Init (void)
{
    lcd_io_init();
    lcd_reset();
}

/*******************************************************************************
* 函数名称 : GUI_X_GetTime
* 功能描述 : 返回系统当前时间
* 输入参数 : 无
* 输出参数 : 无
* 调用关系 : 1) GUI_Delay() -> GUI_GetTime() -> GUI_X_GetTime()
*            2) GUI_TIMER_Create() -> GUI_TIMER_Exec() -> GUI_GetTime() -> GUI_X_GetTime()
*            3) GUI_TIMER_Restart() -> GUI_TIMER_Restart() -> GUI_GetTime() -> GUI_X_GetTime()
*******************************************************************************/
int GUI_X_GetTime (void)
{
    return ((int)OSTimeGet());
}

/*******************************************************************************
* 函数名称 : GUI_X_Delay
* 功能描述 : 实现延时功能
* 输入参数 : period  毫妙单位
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : 1) GUI_Init() -> GUI_X_Delay()
*            2) GUI_Delay() -> GUI_X_Delay()
*******************************************************************************/
void GUI_X_Delay (int period)
{
    OSTimeDly((INT16U)period);
}

/*******************************************************************************
* 函数名称 : GUI_X_ExecIdle
* 功能描述 : 当不需要执行任何操作时执行该Idle函数
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : 当没有定义GUI_X_WAIT_EVENT宏时,该接口函数才有意思
*            GUI_WaitEvent() -> (M)GUI_X_WAIT_EVENT()-> GUI_X_ExecIdle()
*******************************************************************************/
void GUI_X_ExecIdle (void)
{
    GUI_X_Delay(1);
}

/*******************************************************************************
* 函数名称 : GUI_X_InitOS
* 功能描述 : 初始化多任务
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : GUI_Init() -> (M)GUITASK_INIT() -> GUITASK_Init() -> GUI_X_InitOS()
*******************************************************************************/
void GUI_X_InitOS (void)
{
    INT8U err;

    s_pOSSem_GUI = OSSemCreate(1);
    OSEventNameSet(s_pOSSem_GUI, "GUI Lock Sem", &err);

    s_pOSMbox_Event = OSMboxCreate((void *)0);
    OSEventNameSet(s_pOSMbox_Event, "GUI Event Mbox", &err);
}

/*******************************************************************************
* 函数名称 : GUI_X_GetTaskId
* 功能描述 : 返回当前任务ID
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 当前任务优先级(相当于ID)
* 调用关系 : 1) (M)GUI_LOCK() -> GUI_Lock() -> GUI_X_GetTaskId()
*            2) (M)GUI_LOCK() -> GUI_Lock() -> _GetTaskNo() -> GUI_X_GetTaskId()
*******************************************************************************/
U32 GUI_X_GetTaskId (void)
{
    return ((U32)(OSTCBCur->OSTCBPrio));
}

/*******************************************************************************
* 函数名称 : GUI_X_Lock
* 功能描述 : 多任务上锁操作,用于多任务调用时保护LCD及关键数据的访问
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : (M)GUI_LOCK() -> GUI_Lock() -> GUI_X_Lock()
*******************************************************************************/
void GUI_X_Lock (void)
{
    INT8U err;

    OSSemPend(s_pOSSem_GUI, 0, &err);
}

/*******************************************************************************
* 函数名称 : GUI_X_Unlock
* 功能描述 : 解锁操作,用于多任务调用时保护LCD及关键数据的访问
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : (M)GUI_UNLOCK() -> GUI_UnLock() -> GUI_X_Unlock()
*******************************************************************************/
void GUI_X_Unlock (void)
{
    (void)OSSemPost(s_pOSSem_GUI);
}

/*******************************************************************************
* 函数名称 : GUI_X_WaitEvent
* 功能描述 : 等待一个事件
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : (M)GUI_X_WAIT_EVENT()->GUI_X_WaitEvent()
*******************************************************************************/
void GUI_X_WaitEvent (void)
{
    INT8U err;

    (void)OSMboxPend(s_pOSMbox_Event, 0, &err);
}

/*******************************************************************************
* 函数名称 : GUI_X_SignalEvent
* 功能描述 : 发送一个事件
* 输入参数 : 无
* 输出参数 : 无
* 返回参数 : 无
* 调用关系 : (M)GUI_X_SIGNAL_EVENT()->GUI_X_SignalEvent()
*******************************************************************************/
void GUI_X_SignalEvent (void)
{
    (void)OSMboxPost(s_pOSMbox_Event, (void *)1);
}